{
    "version": "https://www.jsonfeed.org/version/1.1/",
    "title": "",
    "home_page_url": "https://johan.im",
    "feed_url": "https://johan.im/micro.json",
    "favicon": "https://johan.im/favicon.png",
    "authors": [{
        "name": "Johan Brook",
        "url": "https://johan.im",
        "avatar": "https://johan.im/.well-known/avatar.jpg"
    }],
    "language": "en-GB",
    "items": [
        
        {
            "id": "https://johan.im/mind/20240118204458/",
            "url": "https://johan.im/mind/20240118204458/",
            
            "summary": "We arrived to Koh Lanta a few days ago, where we'll spend the next two months. While I like long stays in locations, it doesn't come without risk. Especially when bringing kids. \"Will we like it? Will it be boring? Will there be too many tourists? Will we be able to create an everyday life?\" are questions which I've had during the days up until arriving. I think this kind of travelling is one part experience and one part \"Just Do It\". For experience: you just have to trust your gut instincts, and also your skills and ability to integrate well and have a good time. The \"Just Do It\" part is self-explanational.",
            
            
            "tags": ["travels","thailand"],
            
            
            "_location": "Koh Lanta, Thailand",
            
            
            "content_html": "<p>We arrived to Koh Lanta a few days ago, where we'll spend the next two months. While I like long stays in locations, it doesn't come without risk. Especially when bringing kids. &quot;Will we like it? Will it be boring? Will there be too many tourists? Will we be able to create an everyday life?&quot; are questions which I've had during the days up until arriving. I think this kind of travelling is one part experience and one part &quot;Just Do It&quot;. For experience: you just have to trust your gut instincts, and also your skills and ability to integrate well and have a good time. The &quot;Just Do It&quot; part is self-explanational.</p>\n<p>Koh Lanta is super so far though. We live just by Klong Dao beach, which is a super relaxed and cool beach: restaurants, bars, and cafés on one side, and looooong waves on the other. And yes: there <em>are</em> a ton of tourists (we among them!) — mostly Scandinavian — but I've accepted that now (haha).</p>\n<p>A few days in, we've found some kind of a rhythm:</p>\n<ol>\n<li>Early morning, I either sleep in and hang out with the kids, or do exercise (running or gym).</li>\n<li>Late morning, either me or my wife gets &quot;off time&quot;. The other one goes swimming with the kids.</li>\n<li>At lunch, the baby sleeps and the older one hangs out inside for some calm time near the A/C. One of us parents\ncan go outside.</li>\n<li>After lunch, we do some activity. For now that list still only consists of… more swimming 😅</li>\n<li>Late afternoon, it has gotten less hot outside, and we can hang out on the beach just by the shallow water where\nthe kids can play and we can bring takeaway thai food, while watching the beginning of the sunset.</li>\n</ol>\n<p>What I love so far with Koh Lanta:</p>\n<ol>\n<li>The ease of living. Many things just exist at your doorstep. A decent supermarket, phone stores for prepaid SIM cards, cafés, cheap thai food joints, pad thai stands, drug stores. Products of years of mass tourism!</li>\n<li>The picturesque beach. I have to pinch myself every morning.</li>\n<li>The pleasant locals. Not <em>everybody</em> are super happy and friendly (I reckon also a product of years of mass tourism!), but everybody <em>are</em> helpful and solutions oriented. They love babies so much, by the way. Everybody are smiling and acknowledging our 10 month old baby, who beams back at them. If I would do that back home in Stockholm… I… I don't know what would happen.</li>\n</ol>\n<p>For me, I <em>love</em> the heat that comes with tropical weather. It makes me a tad slower, but overall I prefer to be surrounded by warm 30°C air versus mere 20°C air (which we get in Sweden on averege in the summers, it feels like). A/Cs help a lot, sure. But even without them, I'd just <em>exist</em> in the heat (and swim a lot).</p>",
            "date_published": "2024-01-18T13:44:58Z"
        },
        
        {
            "id": "https://johan.im/mind/20240106124758/",
            "url": "https://johan.im/mind/20240106124758/",
            
            
            
            
            "content_html": "<p>Testing my Mastodon integration.</p>",
            "date_published": "2024-01-06T11:47:58Z"
        },
        
        {
            "id": "https://johan.im/mind/20231215140531/",
            "url": "https://johan.im/mind/20231215140531/",
            
            "summary": "I was in a bookstore to get a Christmas gift today over lunch. It was an independent, small store — not one of the big book chains’ shops. Many books had small paper notes with the staff’s personal thoughts, and many were signed by the authors, who frequently visited the shop on signing events and book talks.",
            
            
            
            "_location": "My Mac shortcut",
            
            
            "content_html": "<p>I was in a bookstore to get a Christmas gift today over lunch. It was an independent, small store — not one of the big book chains’ shops. Many books had small paper notes with the staff’s personal thoughts, and many were signed by the authors, who frequently visited the shop on signing events and book talks.</p>\n<p>I just got a really fuzzy feeling entering the small venue, and even more so after chatting with the sole clerk.</p>\n<p>Entering a bookstore is like entering a whole separate universe where time stands still. When I was travelling around in the world, I would always get to a bookstore when in a new city just to feel “rooted” — kind of like finding a safe house.</p>",
            "date_published": "2023-12-15T14:05:31Z"
        },
        
        {
            "id": "https://johan.im/mind/202312132015/",
            "url": "https://johan.im/mind/202312132015/",
            
            "summary": "Finished watching the David Beckham documentary. I *know* it’s super produced and sanctioned by the Beckhams and all that. But. I liked it. Especially the ending, where the family hang out in present day England at their countryside estate. It felt real, in a way (even though again: I *know* it’s staged 😄).",
            
            
            
            "_location": "My Mac shortcut",
            
            
            "content_html": "<p>Finished watching the David Beckham documentary. I <em>know</em> it’s super produced and sanctioned by the Beckhams and all that. But. I liked it. Especially the ending, where the family hang out in present day England at their countryside estate. It felt real, in a way (even though again: I <em>know</em> it’s staged 😄).</p>\n<p>It was a cool story arch, even though I guess I appreciated it because of the nostalgia. The <em>feels</em> when images appeared of Luis Figo, Zidane, Ronaldo, Rio Ferdinand, and Ryan Giggs and the others. I used to play Fifa 2003 on PC with those players, and they were all around when we were talking football in school.</p>",
            "date_published": "2023-12-13T20:15:35Z"
        },
        
        {
            "id": "https://johan.im/mind/202312101058/",
            "url": "https://johan.im/mind/202312101058/",
            
            
            
            "_location": "My iOS shortcut",
            
            
            "content_html": "<p>Today is a Red Hot Chili Peppers day. <a href=\"https://open.spotify.com/playlist/6l2elAUv3W4sCfPxN3my8g?si=MbrzW2QsTyS4VCiolOE4BQ&amp;pi=e-3oMu2Wv1S5Sx\">Here’s my playlist</a>.</p>",
            "date_published": "2023-12-10T10:58:33Z"
        },
        
        {
            "id": "https://johan.im/mind/202312071945/",
            "url": "https://johan.im/mind/202312071945/",
            
            "summary": "[ArrowJS](https://www.arrow-js.com) is my spirit animal JS library at the moment.\n\n*If* you need a library on the frontend, I’d use this one.\n\n- ✅ tiny (2kB). can read the source code in 10 min.\n- ✅ reactive, with observable signals/atoms.\n- ✅ no build, no JSX, no dependencies.",
            
            
            
            "_location": "My Mac shortcut",
            
            
            "content_html": "<p><a href=\"https://www.arrow-js.com/\">ArrowJS</a> is my spirit animal JS library at the moment.</p>\n<p><em>If</em> you need a library on the frontend, I’d use this one.</p>\n<ul>\n<li>✅ tiny (2kB). can read the source code in 10 min.</li>\n<li>✅ reactive, with observable signals/atoms.</li>\n<li>✅ no build, no JSX, no dependencies.</li>\n</ul>\n<p>It abstracts away sharp edges with the DOM, and does the reactive boilerplate for you. I could easily just copy-paste the source into a vendor/ directory and call it a day.</p>",
            "date_published": "2023-12-07T19:45:11Z"
        },
        
        {
            "id": "https://johan.im/mind/202311292010/",
            "url": "https://johan.im/mind/202311292010/",
            
            "summary": "Messing around with the styling and structure here on the website again. I'm so inspired by all the personal sites I stumble on in my feed. But not inspired enough to actually produce as much content here as I would love to 😄",
            
            
            
            "_location": "My couch in Stockholm",
            
            
            "content_html": "<p>Messing around with the styling and structure here on the website again. I'm so inspired by all the personal sites I stumble on in my feed. But not inspired enough to actually produce as much content here as I would love to 😄</p>\n<p>Been reading a lot about <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_components\">Web Components</a> recently. They're having a sort of renaissance at the moment — not sure why this timing actually — much thanks to them being a tool in the box when building with progressive enhancement. All PE thought leaders are going on about the beauty of Web Components and &quot;how you don't need any big JS or Virtual DOM libraries at all!!&quot;. I get that for small, self-contained UI components, but for anything non-trivial, you're kind of bound to reinvent something inhouse for your app anyway, no? I guess Web Components fill the hole where you just want to drop a custom element in a piece of markup and have a Web Component use the element with contained JS and perhaps CSS.</p>\n<p>But the idea of &quot;HTML Web Components&quot; is really neat, in the way it enhances existing markup. Like this:</p>\n<pre><code class=\"language-html\">&lt;convert-currency to=&quot;USD&quot;&gt;10&lt;/convert-currency&gt;\n&lt;script src=&quot;convert-currency.js&quot; type=&quot;module&quot;&gt;&lt;/script&gt;\n</code></pre>\n<pre><code class=\"language-js\">// convert-currency.js\ncustomElements.define('convert-currency', class extends HTMLElement {\n    connectedCallback() {\n        // use this.querySelector() and other DOM API methods to convert\n        // the text content to the currency from this.getAttribute(&quot;to&quot;).\n    }\n})\n</code></pre>\n<ul>\n<li>For server rendered markup, <code>&lt;convert-currency&gt;</code> will render just fine, and <code>10</code> with it. Browsers will just ignore it when parsing the HTML.</li>\n<li>When parsing is done and JS kicks in, we'll &quot;enrich&quot; our custom element with logic.</li>\n</ul>\n<p>My takeaway is that custom elements and Web Components give us a declarative way to encapsulate logic (duh, &quot;components&quot; it's in the name), which creates whole new patterns in how to approach component style architecture but <em>without</em> any 3rd party JS component library.</p>",
            "date_published": "2023-11-29T20:10:49Z"
        },
        
        {
            "id": "https://johan.im/mind/202311180909/",
            "url": "https://johan.im/mind/202311180909/",
            
            
            "tags": ["music"],
            
            
            "_location": "My kitchen table in Stockholm",
            
            
            "content_html": "<p>The <a href=\"https://open.spotify.com/album/34ZmHgTZ7OcRCsrTqbHpSQ?si=8f6JTkP9RjSHBRZIL8Ioog\">latest Kurt Vile album</a> is so very good and Kurt Vile-y. I love how consistent he is and how he's stuck to his style for so long, but still finds new variations to it.</p>",
            "date_published": "2023-11-18T09:09:38Z"
        },
        
        {
            "id": "https://johan.im/mind/202309141429/",
            "url": "https://johan.im/mind/202309141429/",
            
            
            
            "_location": "My desk in Stockholm",
            
            
            "content_html": "<p>The album <a href=\"https://open.spotify.com/album/1S7rBJNPNrCvtdF38sp0Gs?si=3mBWnZBcRPqnmLb7QkXDPA\">&quot;Right Time&quot;</a> (1976) by Mighty Diamonds might be the best reggae album I've heard. Even better than the epic <a href=\"https://open.spotify.com/album/0FqUTYrs4FtPbav2Ry2I1M?si=D4cDCKcURb21lxSvoqeZSA\">&quot;Heart of the Congos&quot;</a> (1977) by The Congos.</p>",
            "date_published": "2023-09-14T14:29:14Z"
        },
        
        {
            "id": "https://johan.im/mind/202308240759/",
            "url": "https://johan.im/mind/202308240759/",
            
            
            
            "_location": "On the run",
            
            
            "content_html": "<p>Today is a “A Tribe Called Quest” day.</p>",
            "date_published": "2023-08-24T07:59:39Z"
        }
        
    ]
}
