{"version":"https://jsonfeed.org/version/1","title":"Johan's Micro Blog","home_page_url":"https://johan.im/","feed_url":"https://johan.im/micro.json","description":"","items":[{"id":"https://johan.im/micro/20240408122909/","url":"https://johan.im/micro/20240408122909/","title":"April 8 — 12:29","content_html":"<p>Being on parental leave is like a brain reset. I experienced the same thing with the first child, and now with the second. My everyday life has shrunk, in a good way, to revolve around the simplest tasks, such as going grocery shopping for extended periods, going to the gym (with the baby sleeping in the stroller), and regular household chores. I guess most modern people (probably men) dread these tasks, but I've come to love them. Being able to focus on the things I do in a rush in normal life is so great.</p>\n<p>Life has slowed down. Nothing is in such great rush. If I do a single chore in a day, that's fine.</p>\n<p>When it comes to having creative outlets, I've worked a lot on this site. My new strategy is to work in short bursts of output, and it must be <em>driven by passion</em>. That is, when I open the laptop lid, I start working on the first thing that comes to mind, may it be tweaking typography in CSS, reworking some content structure, fixing mobile nav bugs. <em>Anything</em> that brings me joy and is kind-of achievable in the present moment until the baby wakes up. It's been working great so far, and it gives me some sense of accomplishment between buying milk and picking up the other daughter from preschool.</p>\n<p>I wish I and anyone could apply this mindset to when we're not on an extended leave.</p>\n","date_published":"Mon, 08 Apr 2024 10:29:09 GMT"},{"id":"https://johan.im/micro/20240324153148/","url":"https://johan.im/micro/20240324153148/","title":"March 24 — 15:31","content_html":"<p>This list of <a href=\"https://dynomight.net/things/\">things that don’t work</a> was fun:</p>\n<blockquote>\n<ol start=\"30\">\n<li>Nonfiction books. Arguably? How much do we really retain?</li>\n</ol>\n</blockquote>\n","date_published":"Sun, 24 Mar 2024 14:31:48 GMT"},{"id":"https://johan.im/micro/20240321081111/","url":"https://johan.im/micro/20240321081111/","title":"March 21 — 08:11","content_html":"<p>It's my first week of parental leave with my second daughter, and I'm <em>here for it</em>. Hanging out in the kitchen, taking\ntime to prep food, listening to <a href=\"https://open.spotify.com/album/15q7N7Wo307mfjqR29NpjF?si=Nn2sveRrT-63afwfTtq6WQ\">music</a>\nwith the baby. I'm appreciative for entering Swedish Spring and Summer this time too.</p>\n<p>Last time, I found the parental leave being a great &quot;brain reset&quot; in order to get perspectives. It (forcefully) slowed\ndown my every day life and made it revolve around fewer things. It also leaves space — outside of work — for project\nideas. For instance, I just thought about coding something with an LLM that suggests recipes based on groceries I've got\nhome at the moment. I'd have less energy for these kinds of silly things if I was to work full time too.</p>\n<p>I think this time, I'll enjoy it even more thanks to the fact that you're 1000x more of a pro and more relaxed with the\nsecond kid 😏</p>\n","date_published":"Thu, 21 Mar 2024 07:11:11 GMT"},{"id":"https://johan.im/micro/20240305094727/","url":"https://johan.im/micro/20240305094727/","title":"March 5 — 09:47","content_html":"<p>This is the final paragraph of Cormac McCarthy’s <em>The Road</em> (no spoiler). It’s the most beautiful paragraph I know of. The weight, the rhythm, the final sentence. Never has a single paragraph done more emotionally to me when I first read it — 15 years old — than a hundred magazine articles on the environmental crisis.</p>\n<blockquote>\n<p>Once there were brook trouts in the streams in the mountains. You could see them standing in the amber current where the white edges of their fins wimpled softly in the flow. They smelled of moss in your hand. Polished and muscular and torsional. On their backs were vermiculate patterns that were maps of the world in its becoming. Maps and mazes. Of a thing which could not be put back. Not be made right again. In the deep glens where they lived all things were older than man and they hummed of mystery.</p>\n</blockquote>\n","date_published":"Tue, 05 Mar 2024 02:47:27 GMT"},{"id":"https://johan.im/micro/20240219203953/","url":"https://johan.im/micro/20240219203953/","title":"February 19 — 20:39","content_html":"<p>I had always been an &quot;anti e-book reader person&quot;, or conversely, &quot;pro physical book person&quot;. In\nhindsight, I'm not sure why: the constant argument had been &quot;I'd like to read <em>real</em> books,\nplease!&quot;. Hold them, carry them, feel them. Etc. etc. It's 150% the sentimentality around books as\nmanifestation of a cultural thing that has been around for hundreds of years. The last bastion,\nwhere the digital revolution yet hasn't been able to put its bits-and-bytes hands on.</p>\n<p>It's also the vanity thing of collecting physical artefacts (and perhaps showing them off). I'm the\nfirst to admit that I like to keep books in my bookshelf! Even though lately, I've borrowed more\nbooks from the local library when the titles have been quite rando, as in &quot;hm, I'm not sure I'll\never gonna re-read this or recommend it to somebody&quot;.</p>\n<p>Anyhow. With e-readers, you lose both the physical sensation and the showing-off of real books. And\nit's amazing!</p>\n<p><em>From now on, this text is about Johan being a decade late in discovering e-readers.</em></p>\n<p>For a longer trip I'm currently on, I bought myself an e-book reader. It's a\n<a href=\"https://eu.kobobooks.com/sv/products/kobo-clara-2e\">Kobo Clara 2E</a>. I refused Amazon's Kindles due\nto lock-in and dislike of Amazon. I got myself a magnetic cover, and off I went.</p>\n<p>Before, I made damn sure this Kobo thing was <em>open</em> enough to transfer these types of ebooks onto\nit:</p>\n<ul>\n<li>Random, free EPubs books.</li>\n<li>DRM protected EPub books.</li>\n<li>Library ebooks.</li>\n</ul>\n<p>as well as sampling books out of the Kobo store. It supposedly has millions of books, and after some\nsampling, I determined that it had the titles I was going to read during my trip. Perfect!</p>\n<p><img src=\"https://eu.kobobooks.com/cdn/shop/products/B_UK-ANZ-Device_Angled_1080x1080_17130470-23c2-498c-be24-8e5429a7f784_962x962.jpg?v=1691690100\" alt=\"Kobo Clara 2E\"></p>\n<p>The Kobo reader is really good. It has a great display, kind of water proof, has good battery life\n(I've charged it once since I got it in mid January, now is late Feburary), a perfect form factor.</p>\n<p>The form factor is something I especially appreciate: I can fit it in my back pocket. I don't think\nthe display is too small at all (6 inches, 300 PPI). Anywhere when I got a minute over, I can just\nhaul it up and get some pages read. You <em>could</em> do the same with a physical book, but even a\npaperback of 600+ pages will be a bit of a brick to carry around. The result? I read in a much\nhigher pace, and therefore a lot more books (since January 14th, I've read four books for a total\nduration of 56 hours). I feel genuinely excited for how this has lowered the threshold for reading\nmore books.</p>\n<p>It's almost like one of the charms with physical books became its baggage: to physically acquire\nthem and transport them around. The ritual became a gatekeeping activity for me. With the e-book\nreader, it's as capitalistic and digital as it can be: I find a book in the Kobo store, buy it with\nmy Apple Pay, and sync it on the device via my account. No more the feels of &quot;opening the first\npages of a freshly bought book&quot;.</p>\n<p>Oh, I've almost forgot <em>the</em> best thing about ebook readers! The ability to read in the evening in\nthe bad shared with a partner who <em>does not</em> want to have any lights on!</p>\n<hr>\n<p>I'm <a href=\"https://johan.im/reading\">currently reading</a> the &quot;My Struggle&quot; series by Karl Ove Knausgård.</p>\n","date_published":"Mon, 19 Feb 2024 13:39:53 GMT"},{"id":"https://johan.im/micro/20240203212100/","url":"https://johan.im/micro/20240203212100/","title":"February 3 — 21:21","content_html":"<p>Maybe it's because I've spent the past weeks in a beachside environment, with very few worries\nbesides watching the baby so she won't eat the sand, but I just don't care for a <em>single</em> bit about\nnew hardware announcements such as the Apple Vision Pro any longer.</p>\n<p>It's so relieving.</p>\n<p>Not trying to be smug or snowflake about it. I simply feel so <em>beyond</em> those kinds of thought\nstreams where I spend more than a second checking the said hardware out.</p>\n","date_published":"Sat, 03 Feb 2024 14:21:00 GMT"},{"id":"https://johan.im/micro/20240118204458/","url":"https://johan.im/micro/20240118204458/","title":"January 18 — 20:44","content_html":"<p>We arrived to Koh Lanta a few days ago, where we'll spend the next two months. While I like long\nstays in locations, it doesn't come without risk. Especially when bringing kids. &quot;Will we like it?\nWill it be boring? Will there be too many tourists? Will we be able to create an everyday life?&quot; are\nquestions which I've had during the days up until arriving. I think this kind of travelling is one\npart experience and one part &quot;Just Do It&quot;. For experience: you just have to trust your gut\ninstincts, and also your skills and ability to integrate well and have a good time. The &quot;Just Do It&quot;\npart is self-explanational.</p>\n<p>Koh Lanta is super so far though. We live just by Klong Dao beach, which is a super relaxed and cool\nbeach: restaurants, bars, and cafés on one side, and looooong waves on the other. And yes: there\n<em>are</em> a ton of tourists (we among them!) — mostly Scandinavian — but I've accepted that now (haha).</p>\n<p>A few days in, we've found some kind of a rhythm:</p>\n<ol>\n<li>Early morning, I either sleep in and hang out with the kids, or do exercise (running or gym).</li>\n<li>Late morning, either me or my wife gets &quot;off time&quot;. The other one goes swimming with the kids.</li>\n<li>At lunch, the baby sleeps and the older one hangs out inside for some calm time near the A/C. One\nof us parents can go outside.</li>\n<li>After lunch, we do some activity. For now that list still only consists of… more swimming 😅</li>\n<li>Late afternoon, it has gotten less hot outside, and we can hang out on the beach just by the\nshallow water where the kids can play and we can bring takeaway thai food, while watching the\nbeginning of the sunset.</li>\n</ol>\n<p>What I love so far with Koh Lanta:</p>\n<ol>\n<li>The ease of living. Many things just exist at your doorstep. A decent supermarket, phone stores\nfor prepaid SIM cards, cafés, cheap thai food joints, pad thai stands, drug stores. Products of\nyears of mass tourism!</li>\n<li>The picturesque beach. I have to pinch myself every morning.</li>\n<li>The pleasant locals. Not <em>everybody</em> are super happy and friendly (I reckon also a product of\nyears of mass tourism!), but everybody <em>are</em> helpful and solutions oriented. They love babies so\nmuch, by the way. Everybody are smiling and acknowledging our 10 month old baby, who beams back\nat them. If I would do that back home in Stockholm… I… I don't know what would happen.</li>\n</ol>\n<p>For me, I <em>love</em> the heat that comes with tropical weather. It makes me a tad slower, but overall I\nprefer to be surrounded by warm 30°C air versus mere 20°C air (which we get in Sweden on averege in\nthe summers, it feels like). A/Cs help a lot, sure. But even without them, I'd just <em>exist</em> in the\nheat (and swim a lot).</p>\n","date_published":"Thu, 18 Jan 2024 13:44:58 GMT"},{"id":"https://johan.im/micro/20240106124758/","url":"https://johan.im/micro/20240106124758/","title":"January 6 — 12:47","content_html":"<p>Testing my Mastodon integration.</p>\n","date_published":"Sat, 06 Jan 2024 11:47:58 GMT"},{"id":"https://johan.im/micro/20231215140531/","url":"https://johan.im/micro/20231215140531/","title":"December 15, 2023 — 15:05","content_html":"<p>I was in a bookstore to get a Christmas gift today over lunch. It was an independent, small store —\nnot one of the big book chains’ shops. Many books had small paper notes with the staff’s personal\nthoughts, and many were signed by the authors, who frequently visited the shop on signing events and\nbook talks.</p>\n<p>I just got a really fuzzy feeling entering the small venue, and even more so after chatting with the\nsole clerk.</p>\n<p>Entering a bookstore is like entering a whole separate universe where time stands still. When I was\ntravelling around in the world, I would always get to a bookstore when in a new city just to feel\n“rooted” — kind of like finding a safe house.</p>\n","date_published":"Fri, 15 Dec 2023 14:05:31 GMT"},{"id":"https://johan.im/micro/202312132015/","url":"https://johan.im/micro/202312132015/","title":"December 13, 2023 — 21:15","content_html":"<p>Finished watching the David Beckham documentary. I <em>know</em> it’s super produced and sanctioned by the\nBeckhams and all that. But. I liked it. Especially the ending, where the family hang out in present\nday England at their countryside estate. It felt real, in a way (even though again: I <em>know</em> it’s\nstaged 😄).</p>\n<p>It was a cool story arch, even though I guess I appreciated it because of the nostalgia. The <em>feels</em>\nwhen images appeared of Luis Figo, Zidane, Ronaldo, Rio Ferdinand, and Ryan Giggs and the others. I\nused to play Fifa 2003 on PC with those players, and they were all around when we were talking\nfootball in school.</p>\n","date_published":"Wed, 13 Dec 2023 20:15:35 GMT"}]}