{"version":"https://jsonfeed.org/version/1","title":"What Johan Is Reading","home_page_url":"https://johan.im/","feed_url":"https://johan.im/reading.json","description":"","items":[{"id":"https://johan.im/reading/nattens-skola/","url":"https://johan.im/reading/nattens-skola/","title":"Nattens Skola","content_html":"I liked \"Nattens Skola\", and became quite immersed in it.\n\nThis is the fourth installment of Knausgård's \"Morgonstjärnan\" series. It's hard to say if it's a different universe from the other three books. The style is what Knausgård does best, but \"Nattens Skola\" contains more twists and turns than usual, and the main character is not that sympathetic at all. This is spelled out in the text quite early as well.\n\nI always appreciate novels where there's a jump in time. I love to see the passing of time and how the author treats it with their characters. Here, the first part is in the 1980s, and the second part is 20 years later (the first part has been given the most space).\n\nIn the other books, I had an easier time keeping up with the purpose of the text, whereas in this one, I constantly tried to look for underlying patterns (deeper than the obvious Faustian theme). Maybe I need to read some analytical texts from people smarter than me. Or, it's just \"less grand\" by design than book number one and three, in the way that there's less of the apocalyptical end-of-days vibe.\n","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Thu, 18 Apr 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/min-kamp-6/","url":"https://johan.im/reading/min-kamp-6/","title":"Min Kamp 6","content_html":"I've finished the final installment of Knausgård's _Min Kamp_ (_My Struggle_) autobiographical series. The full\ncollection of volumes goes over 3000 pages, so it suffices to say I'm pretty dazed now. Feels like I've been into\na tumble dryer and out again.<!--more-->\n\n_Min Kamp_ is an epic amount of work. It retells Knausgård's childhood, adolescence, university years, and\neventually becoming a father — this is over four decades of memories he accounts of in excruciating detail. This\npioneering style of writing, and of course the fact that he writes about real people without changing too many\nnames, was what made these novels unique.\n\nI feel I can't accurately describe how I feel about the series, since English not being my mothertongue. I can only\npraise the level of _detail and honesty_ that has gone into the pages. I am no writer, but I appreciate honesty in\ntexts. Also have been a boy, teenager, a young adult, and now a father myself, I identify with areas and scenes\nbrought up over the six volumes, each describing encompassing chunks of Knausgård's life.\n\nWhat's problematic, of course, with _Min Kamp_ is that he writes about people being close to him, and since he's\nbeing honest, it's not always positive things. His father, mother, brother, his then-wife, old girlfriends, old\ncolleagues are described in the way Knausgård sees them. It's _his_ voice, _his_ views. But he had to do it,\naccording to himself, in order to stay honest to the project.\n\nWhat I'm most touched and deeply affected by in the end, is his and his then-wife Linda Boström Knausgård's story. It begins in the late 90s, and describes their relationship from being lovers in Stockholm to being a family with\nthree kids on the countryside of Skåne in south Sweden. He writes how Linda suffers from being bipolar,\nwhich climaxes at the end of the sixth volume. It's almost like they became fictional figures for me, since I\nwanted it to work out for them _so much_ I forgot they're real people (they separated in 2016. _Sob_). Their years\ntogether are described with such intimacy, which I think is required in order to make it honest and real. It made\nme so empathetic towards both of them. The whole situation: Knausgårds need to write, Linda's mental condition,\ntheir kids, their everyday life. I find myself being happy for them in the light moments, and sad in the dark\nperiods. They become real, because they _are_ real.\n\nKnausgård shows that every person's life is indeed \"interesting\" and is a well of experiences from which you can draw stories from. Even though he admits later that he wouldn't have done the project if he knew the\ncosts, I'm personally happy that he did, since it's a remarkable piece of work. Does he fully portray his wife\nLinda's authentic inner self? No. Is it right to write about his dead father and grandmother in the way he does?\nMaybe, maybe not.\n\nI've read quite many opinions about the series, and it's what you'd expect: much praise, but a lot of analysis\ngoing on about ethics, chauvinism, and self-centerism (is that a word?). In the end, I was entertained and adore\nKarl Ove Knausgård's style and angle.\n","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Mon, 01 Apr 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/min-kamp-5/","url":"https://johan.im/reading/min-kamp-5/","title":"Min Kamp 5","content_html":"See _[Min Kamp 6](/reading/min-kamp-6)_.","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Wed, 28 Feb 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/min-kamp-4/","url":"https://johan.im/reading/min-kamp-4/","title":"Min Kamp 4","content_html":"See _[Min Kamp 6](/reading/min-kamp-6)_.","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Tue, 20 Feb 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/min-kamp-3/","url":"https://johan.im/reading/min-kamp-3/","title":"Min Kamp 3","content_html":"See _[Min Kamp 6](/reading/min-kamp-6)_.","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Tue, 13 Feb 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/min-kamp-2/","url":"https://johan.im/reading/min-kamp-2/","title":"Min Kamp 2","content_html":"See _[Min Kamp 6](/reading/min-kamp-6)_.","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Sat, 03 Feb 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/min-kamp-1/","url":"https://johan.im/reading/min-kamp-1/","title":"Min Kamp 1","content_html":"See _[Min Kamp 6](/reading/min-kamp-6)_.","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Wed, 24 Jan 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/det-tredje-riket/","url":"https://johan.im/reading/det-tredje-riket/","title":"Det Tredje Riket","content_html":"I loved it just as much as the first one in the series (I loved the second one less). It's something in Knausgård's language which is so, so good.","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Sun, 14 Jan 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/tunnel-29/","url":"https://johan.im/reading/tunnel-29/","title":"Tunnel 29 — The True Story of an Extraordinary Escape Beneath the Berlin Wall","content_html":"This is kind of a \"dramatised\" documentary of actual events. Tons of historical metadata along the way. It's a bit cheesy sometimes, but I totally admit it was a page turner. And most importantly, it taught me a lot about the real life behind the Wall, in East Berlin (hint: Stasi were the biggest assholes ever).","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Thu, 04 Jan 2024 00:00:00 GMT"},{"id":"https://johan.im/reading/berlin/","url":"https://johan.im/reading/berlin/","title":"Berlin","content_html":"Continuing my journey towards being a fully fledged dad. 150% detailed account of the Allied invasion of Germany in 1945. So much stuff I didn't know. Lots of stories about the conditions of the soldiers, civilians, and the fates of prisoners (hint: all quite horrible).","date_published":"Thu, 18 Apr 2024 08:35:32 GMT","date_modified":"Sun, 15 Oct 2023 00:00:00 GMT"}]}